nxvpro/Resources/wan_disco_template.xml

<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:sc="http://www.w3.org/2003/05/soap-encoding" xmlns:dn="http://www.onvif.org/ver10/network/wsdl" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing">	
	<s:Body>
		<d:ProbeMatches>
			<d:ProbeMatch>				
				<d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
				<d:Scopes>onvif://www.onvif.org/name/_CAM_NAME_ onvif://www.onvif.org/Profile/Streaming onvif://www.onvif.org/type/Network_Video_Transmitter</d:Scopes>
				<d:XAddrs>_XADDR_</d:XAddrs>
				<d:MetadataVersion>1</d:MetadataVersion>
			</d:ProbeMatch>
		</d:ProbeMatches>
	</s:Body>
</s:Envelope>
